Revit 2027 API
EnergyAnalysisMaterial.ThermalResistance Property
 The thermal resistance (R-value) of the material, in m^2*K/W (eqivelent to K*s^3/kg).
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double ThermalResistance { get; }
Public ReadOnly Property ThermalResistance As Double
	Get
public:
property double ThermalResistance {
	double get ();
}
member ThermalResistance : float with get
Property Value
Double
See Also
Reference
EnergyAnalysisMaterial Class
Autodesk.Revit.DB.Analysis Namespace